20210911183844-lisp.org
:PROPERTIES:
:ID:       18fbe00f-4ec8-4ca0-adfa-2d1381669642
:header-args+: :wrap :results raw
:END:
#+title: LISP
* 概要
LISPは[[id:868ac56a-2d42-48d7-ab7f-7047c85a8f39][Programming Language]]。1958年に登場して以来、多数の方言が存在し、
現在も使われ続けている。

- [[id:2337587f-0d95-484f-922a-f4cca1ace49e][Common Lisp]]
- [[id:53a7a781-8398-4069-8735-6ac5b8c3bc05][Scheme]]
- [[id:c7e81fac-9f8b-4538-9851-21d4ff3c2b08][Emacs Lisp]]
* Memo
** [[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]での実行環境準備
例えばCommon Lispの実装の1つSBCL(Steel Bank Common Lisp)を使用する方法。
[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]のラッパーライブラリはSLIME。起動からコンソール画面表示までやってくれる。

#+caption: SBCLをインストール
#+begin_src shell
  $sudo apt-get install sbcl
#+end_src

#+caption: SBCLを選択
#+begin_src emacs-lisp
  (setq inferior-lisp-program "sbcl")
#+end_src
を評価。
~M-x slime~ で、接続して使用できるようになる。
* Tasks
** TODO [[https://www.amazon.co.jp/-/en/%E7%AC%B9%E5%B7%9D-%E8%B3%A2%E4%B8%80-ebook/dp/B01B1FYQVQ/?_encoding=UTF8&pd_rd_w=eNfAv&pf_rd_p=5ce033f0-5b81-46ec-8910-385cc2abff14&pf_rd_r=XQTYBYBT7WDGZDYXJ1F3&pd_rd_r=cc740f97-a72c-4bcc-a32f-c926d52344fe&pd_rd_wg=njTzq&ref_=pd_gw_ci_mcx_mr_hp_d][Amazon.co.jp: やさしいLispの作り方: C言語で作るミニミニLisp処理系 eBook : 笹川 賢一: Kindle Store]] :Read:
** TODO [[http://www.asahi-net.or.jp/~kc7k-nd/][On Lisp日本語訳 草稿置き場]]                                    :Read:
マクロの書き方の詳しい解説。
** TODO [[https://www.vocrf.net/docs_ja/jsicp.pdf][SICP非公式日本語版 翻訳改訂版]]                                 :Read:
↓の訳(かなりよくないよう)の全面改良版。
** TODO [[https://sicp.iijlab.net/fulltext/xcont.html][計算機プログラムの構造と解釈 第二版]]                           :Read:
通称SICP、[[id:e3b48a23-21bc-4cdf-8395-052fab9fecb5][Computer Science]]で有名な本。
** TODO マンガで分かるLisp                                            :Read:
- http://lambda.bugyo.tk/cdr/mwl/
- [[http://www.inf.ufsc.br/~aldo.vw/func/cl-quick-reference.pdf][wilburs-lisp-intro.dvi]]
* Reference
** [[https://www.amazon.com/Lisp-Small-Pieces-Christian-Queinnec-ebook-dp-B00AKE1U6O/dp/B00AKE1U6O/ref=mt_other?_encoding=UTF8&me=&qid=][Lisp in Small Pieces , Queinnec, Christian, Callaway, Kathleen, eBook - Amazon.com]]
コンパイラの章があるよう。
* Archives
