20210911183844-lisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LISP</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">LISP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9c5341">概要</a></li>
<li><a href="#orgbeb6950">Memo</a>
<ul>
<li><a href="#orgf519f5c">Emacsでの実行環境準備</a></li>
</ul>
</li>
<li><a href="#org994348e">Tasks</a>
<ul>
<li><a href="#orge5aaa10"><span class="todo TODO">TODO</span> Amazon.co.jp: やさしいLispの作り方: C言語で作るミニミニLisp処理系 eBook : 笹川 賢一: Kindle Store</a></li>
<li><a href="#org6b6b96f"><span class="todo TODO">TODO</span> On Lisp日本語訳 草稿置き場</a></li>
<li><a href="#org6ca0a6d"><span class="todo TODO">TODO</span> SICP非公式日本語版 翻訳改訂版</a></li>
<li><a href="#org8a7d696"><span class="todo TODO">TODO</span> 計算機プログラムの構造と解釈 第二版</a></li>
<li><a href="#org4314ddd"><span class="todo TODO">TODO</span> マンガで分かるLisp</a></li>
</ul>
</li>
<li><a href="#org4317fe1">Reference</a>
<ul>
<li><a href="#org640d447">Lisp in Small Pieces , Queinnec, Christian, Callaway, Kathleen, eBook - Amazon.com</a></li>
</ul>
</li>
<li><a href="#org56c9427">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd9c5341" class="outline-2">
<h2 id="orgd9c5341"><a href="#orgd9c5341">概要</a></h2>
<div class="outline-text-2" id="text-orgd9c5341">
<p>
LISPは<a href="20210509101246-programming_language.html#ID-868ac56a-2d42-48d7-ab7f-7047c85a8f39">Programming Language</a>。1958年に登場して以来、多数の方言が存在し、
現在も使われ続けている。
</p>

<ul class="org-ul">
<li><a href="20210926152425-common_lisp.html#ID-2337587f-0d95-484f-922a-f4cca1ace49e">Common Lisp</a></li>
<li><a href="20210926144913-scheme.html#ID-53a7a781-8398-4069-8735-6ac5b8c3bc05">Scheme</a></li>
<li><a href="20210509122633-emacs_lisp.html#ID-c7e81fac-9f8b-4538-9851-21d4ff3c2b08">Emacs Lisp</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbeb6950" class="outline-2">
<h2 id="orgbeb6950"><a href="#orgbeb6950">Memo</a></h2>
<div class="outline-text-2" id="text-orgbeb6950">
</div>
<div id="outline-container-orgf519f5c" class="outline-3">
<h3 id="orgf519f5c"><a href="#orgf519f5c"><a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>での実行環境準備</a></h3>
<div class="outline-text-3" id="text-orgf519f5c">
<p>
例えばCommon Lispの実装の1つSBCL(Steel Bank Common Lisp)を使用する方法。
<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>のラッパーライブラリはSLIME。起動からコンソール画面表示までやってくれる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>SBCLをインストール</label><pre class="src src-shell">$<span class="org-variable-name">sudo</span> apt-get install sbcl
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>SBCLを選択</label><pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> inferior-lisp-program <span class="org-string">"sbcl"</span>)
</pre>
</div>
<p>
を評価。
<code>M-x slime</code> で、接続して使用できるようになる。
</p>
</div>
</div>
</div>
<div id="outline-container-org994348e" class="outline-2">
<h2 id="org994348e"><a href="#org994348e">Tasks</a></h2>
<div class="outline-text-2" id="text-org994348e">
</div>
<div id="outline-container-orge5aaa10" class="outline-3">
<h3 id="orge5aaa10"><a href="#orge5aaa10"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/-/en/%E7%AC%B9%E5%B7%9D-%E8%B3%A2%E4%B8%80-ebook/dp/B01B1FYQVQ/?_encoding=UTF8&amp;pd_rd_w=eNfAv&amp;pf_rd_p=5ce033f0-5b81-46ec-8910-385cc2abff14&amp;pf_rd_r=XQTYBYBT7WDGZDYXJ1F3&amp;pd_rd_r=cc740f97-a72c-4bcc-a32f-c926d52344fe&amp;pd_rd_wg=njTzq&amp;ref_=pd_gw_ci_mcx_mr_hp_d">Amazon.co.jp: やさしいLispの作り方: C言語で作るミニミニLisp処理系 eBook : 笹川 賢一: Kindle Store</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
</div>
<div id="outline-container-org6b6b96f" class="outline-3">
<h3 id="org6b6b96f"><a href="#org6b6b96f"><span class="todo TODO">TODO</span> <a href="http://www.asahi-net.or.jp/~kc7k-nd/">On Lisp日本語訳 草稿置き場</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-org6b6b96f">
<p>
マクロの書き方の詳しい解説。
</p>
</div>
</div>
<div id="outline-container-org6ca0a6d" class="outline-3">
<h3 id="org6ca0a6d"><a href="#org6ca0a6d"><span class="todo TODO">TODO</span> <a href="https://www.vocrf.net/docs_ja/jsicp.pdf">SICP非公式日本語版 翻訳改訂版</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-org6ca0a6d">
<p>
↓の訳(かなりよくないよう)の全面改良版。
</p>
</div>
</div>
<div id="outline-container-org8a7d696" class="outline-3">
<h3 id="org8a7d696"><a href="#org8a7d696"><span class="todo TODO">TODO</span> <a href="https://sicp.iijlab.net/fulltext/xcont.html">計算機プログラムの構造と解釈 第二版</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-org8a7d696">
<p>
通称SICP、<a href="20210926151212-computer_science.html#ID-e3b48a23-21bc-4cdf-8395-052fab9fecb5">Computer Science</a>で有名な本。
</p>
</div>
</div>
<div id="outline-container-org4314ddd" class="outline-3">
<h3 id="org4314ddd"><a href="#org4314ddd"><span class="todo TODO">TODO</span> マンガで分かるLisp&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-org4314ddd">
<ul class="org-ul">
<li><a href="http://lambda.bugyo.tk/cdr/mwl/">http://lambda.bugyo.tk/cdr/mwl/</a></li>
<li><a href="http://www.inf.ufsc.br/~aldo.vw/func/cl-quick-reference.pdf">wilburs-lisp-intro.dvi</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4317fe1" class="outline-2">
<h2 id="org4317fe1"><a href="#org4317fe1">Reference</a></h2>
<div class="outline-text-2" id="text-org4317fe1">
</div>
<div id="outline-container-org640d447" class="outline-3">
<h3 id="org640d447"><a href="#org640d447"><a href="https://www.amazon.com/Lisp-Small-Pieces-Christian-Queinnec-ebook-dp-B00AKE1U6O/dp/B00AKE1U6O/ref=mt_other?_encoding=UTF8&amp;me=&amp;qid=">Lisp in Small Pieces , Queinnec, Christian, Callaway, Kathleen, eBook - Amazon.com</a></a></h3>
<div class="outline-text-3" id="text-org640d447">
<p>
コンパイラの章があるよう。
</p>
</div>
</div>
</div>
<div id="outline-container-org56c9427" class="outline-2">
<h2 id="org56c9427"><a href="#org56c9427">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
